////////////////////////////////////////////////////////////////////////////////////////////////////
// (C) Copyright HARADA, Takahiko 2018 All rights reserved.
////////////////////////////////////////////////////////////////////////////////////////////////////
package com.haradatakahiko.security.report;
////////////////////////////////////////////////////////////////////////////////////////////////////
import java.io.Serializable;
////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * 変更結果レポート種別
 * @author はらだ　たかひこ
 */
@SuppressWarnings("serial")
public enum ReportType implements Serializable
{
    /** テキストファイル */
    TEXT("テキストファイル"),
    
    /** メール */
    MAIL("メール"),
    
    /** 何も出力しない */
    NULL("なし");
    
    /** 日本語名称 */
    private String description;
    
    //----------------------------------------------------------------------------------------------
    /**
     * コンストラクタ
     * @param arg 日本語名称
     */
    private ReportType(String arg)
    {
        description = arg;
    }
    //----------------------------------------------------------------------------------------------
    /**
     * このオブジェクトの文字列表現を返す
     * @return このオブジェクトの文字列表現
     */
    @Override
    public String toString()
    {
        return description;
    }
}
