////////////////////////////////////////////////////////////////////////////////
// (C) Copyright HARADA, Takahiko 2018 All rights reserved.
////////////////////////////////////////////////////////////////////////////////
package com.haradatakahiko.security;
////////////////////////////////////////////////////////////////////////////////
import java.io.Serializable;
////////////////////////////////////////////////////////////////////////////////
/**
 * ファイル変更区分enum
 * @author はらだ　たかひこ
 */
@SuppressWarnings("serial")
public enum ModifyType implements Serializable
{
    /** 追加 */
    ADD("追加"),
    
    /** 変更 */
    MODIFY("変更"),
    
    /** 同一 */
    SAME("同一"),
    
    /** 削除 */
    DELETE("削除"),
    
    /** 無視 */
    IGNORE("無視");
    //--------------------------------------------------------------------------
    /** 日本語名称 */
    private String description;
    //--------------------------------------------------------------------------
    /**
     * コンストラクタ
     * @param arg 日本語名称
     */
    private ModifyType(String arg)
    {
        description = arg;
    }
    //--------------------------------------------------------------------------
    /**
     * このオブジェクトの文字列表現を返す
     * @return このオブジェクトの文字列表現
     */
    @Override
    public String toString()
    {
        return description;
    }
}
