////////////////////////////////////////////////////////////////////////////////////////////////////
// (C) Copyright HARADA, Takahiko 2018 All rights reserved.
////////////////////////////////////////////////////////////////////////////////////////////////////
package com.haradatakahiko.security.ignore;
////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * 無視するディレクトリエントリのタイプ
 * @author はらだ　たかひこ
 */
public enum IgnoreType
{
    /** 拡張子 */
    EXTENSION("拡張子"),
    
    /** ディレクトリ */
    DIRECTORY("ディレクトリ"),
    
    /** 正規表現 */
    REGULAR_EXPRESSION("正規表現");
    //----------------------------------------------------------------------------------------------
    /** 日本語名称 */
    private String name;
    //----------------------------------------------------------------------------------------------
    /**
     * コンストラクタ
     * @param arg 日本語名称
     */
    private IgnoreType(String arg)
    {
        name = arg;
    }
    //----------------------------------------------------------------------------------------------
    /**
     * このオブジェクトの文字列表現を返す
     * @return このオブジェクトの文字列表現
     */
    @Override
    public String toString()
    {
        return name;
    }
}
